IDEA StatiCa Open Model
WeldParam.WeldType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the type of the weld
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public WeldType WeldType { get; set; }
Public Property WeldType As WeldType
	Get
	Set
public:
property WeldType WeldType {
	WeldType get ();
	void set (WeldType value);
}
Property Value
Type: WeldType
See Also
Reference
WeldParam Class
IdeaRS.OpenModel.Parameters Namespace